var app = new Vue({
    el: '.online-registry',
    data: {
        input: '',
        searchName: '',
        areaNamesArray: [
            {liter: 'А', array: ['Адыгея', 'Алтай', 'Алтайский край', 'Амурская область', 'Архангельская область', 'Астраханская область']},
            {liter: 'Б', array: ['Байконур', 'Башкартостан', 'Башкартостан', 'Белгородская область', 'Брянская область', 'Бурятия']},
            {liter: 'В', array: ['Владимирская область', 'Волгородская область', 'Вологодская область', 'Воронежская']},
            {liter: 'Д', array: ['Дагестан']},
            {liter: 'E', array: ['Еврейская автономная область']},
            {liter: 'З', array: ['Забайкальский край']},
            {liter: 'И', array: ['Ивановская область', 'Ингушетия', 'Иркутская область']},
            {liter: 'К', array: ['Кабардино-Балкария', 'Калининградская область', 'Калмыкия', 'Калужская область', 'Камчатский край', 'Карачаево-Черкесия', 'Карелия', 'Кемеровская область', 'Кировская область', 'Коми', 'Костромская область', 'Краснодарский край', 'Красноярский край', 'Крым', 'Курганская область', 'Курская область']},
            {liter: 'Л', array: ['Ленинградская область', 'Липецкая область']},
            {liter: 'М', array: ['Магаданская область', 'Марий Эл', 'Мордовия', 'Московская область', 'Мурманская область']},
            {liter: 'Н', array: ['Ненецкий автономный округ', 'Нижегородская область', 'Новгородская область', 'Новосибирская область']},
            {liter: 'О', array: ['Омская область', 'Оренбургская область', 'Орловская область']},
            {liter: 'П', array: ['Пензенская область', 'Пермский край', 'Приморский край', 'Псовская область']},
            {liter: 'Р', array: ['Ростовская область', 'Рязанская область']},
            {liter: 'C', array: ['Самарская область', 'Саратовская область', 'Сахалинская область', 'Свердловская область', 'Севастополь', 'Северная Осетия', 'Смоленская область', 'Ставропольский край']},
            {liter: 'Т', array: ['Тамбовская область', 'Татарстан', 'Тверская область', 'Томская область', 'Тульская область', 'Тыва', 'Тюменская область']},
            {liter: 'У', array: ['Удмуртия', 'Ульяновская область']},
            {liter: 'Х', array: ['Хабаровский край', 'Хакасия', 'Ханты-Мансийский АО']},
            {liter: 'Ч', array: ['Челябинская область', 'Чечня', 'Чувашия', 'Чукотский автономный округ']},
            {liter: 'Я', array: ['Ямало-Ненецкий АО', 'Ярославская область']},
            
        ],
        shortcuts: [
            'Москва',
            'Санкт-Петербург'
        ],
    },
    computed: {
        filteredAreas() {
            if(this.searchName !== '') {
                var temp = this.searchName;
                var array = this.areaNamesArray
                return this.areaNamesArray.filter(function(item) {
                    if(item.liter == temp[0]) {
                        return item.array.filter(item => item.indexOf(temp)  > -1);
                    }
                });
            } else {
                return this.areaNamesArray;
            }
        },
    },
    methods: {
        goSearch: function(){
            if(this.input !== '') {
                this.searchName = this.input;
            } else {
                this.searchName = '';
            }
        },
    }
})